Revit 2027 API
BuiltInFailures.DimensionFailures.ReportingParamAlreadyLabelsToAnotherDim Property
 Cannot label multi-dimensions to one reporting parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ReportingParamAlreadyLabelsToAnotherDim { get; }
Public Shared ReadOnly Property ReportingParamAlreadyLabelsToAnotherDim As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ReportingParamAlreadyLabelsToAnotherDim {
	FailureDefinitionId^ get ();
}
static member ReportingParamAlreadyLabelsToAnotherDim : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace